app/controllers/comments_controller.rb

def create
  @post = Post.find(params[:post_id])
  @comment = @post.comments.create(params[:comment].permit(:name ,:body))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "First Comment"], ["body", "very good"], ["post_id", 8], ["created_at", "2022-11-23 07:40:44.075043"], ["updated_at", "2022-11-23 07:40:44.075043"]]