app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "validated"], ["updated_at", "2022-11-22 11:34:30.950103"], ["id", 7]]
---
   def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body))